{
    "carpentry": {"id": "carpentry",
            "name": "Carpentry",
            "type": "sea",
            "category": "Seafaring",
            "costs": 8,
            "description": "Our island's forests provide us with excellent building material so that we can create strong woodwork for the roofs of our buildings. But to ensure that this is the case, lumber must be carefully selected and handled properly! A carpenter in our town would take care of this and would use up a lot less building material!",
            "allows": "Building of Carpentries",
            "effect": "",
            "requirements": []
            },
    "dry-dock": {"id": "dry-dock",
            "name": "Dry-Dock",
            "type": "mil",
            "category": "Military",
            "costs": 8,
            "description": "A basin at the sea where water can be drained makes it so much easier for us to build ships and set sail. May a mighty fleet arise that teaches our enemies the true meaning of fear!",
            "allows": "Construction of a second trading port, shipyard",
            "effect": "",
            "requirements": []
            },
    "deck_weapons": {"id": "deck_weapons",
            "name": "Deck Weapons",
            "type": "sea",
            "category": "Seafaring",
            "costs": 12,
            "description": "A rotating attachment for our battle ships on which we can mount huge weapons! For a start our inventors have mounted a huge crossbow on it. But we assume that the attachment will be able to bear other machines, too. So as soon as one of our scientists has an idea we can install it on our ships without a problem.",
            "allows": "Building of ballista ships in the shipyard",
            "effect": "",
            "requirements": ["carpentry","dry-dock"]
            },
    "conservation": {"id": "conservation",
            "name": "Conservation",
            "type": "eco",
            "category": "Economy",
            "costs": 12,
            "description": "We have learned how to store and protect our resources in the long term from wind and weather. Additionally a part of our resources is safe from pirates and other villains, who might want to steal from us!",
            "allows": "Building of warehouses",
            "effect": "",
            "requirements": []
            },
    "piracy": {"id": "piracy",
            "name": "Piracy",
            "type": "sea",
            "category": "Seafaring",
            "costs": 18,
            "description": "A powerful Pirate Fortress with a strong crew eager for your orders. They are looking to loot capture points and gold. Fame and enormous amounts of resources beckon the most successful pirates. From here you can start raids on other Pirate Fortresses.",
            "allows": "construction of Pirate Fortresses, Capture Runs, Raids, participation in the Capture Points Highscores",
            "effect": "",
            "requirements": ["deck_weapons"]
            },
    "ship_maintenance": {"id": "ship_maintenance",
            "name": "Ship maintenance",
            "type": "sea",
            "category": "Seafaring",
            "costs": 24,
            "description": "If we always keep our ships nice and clean, they won't have to be repaired that often. It will also keep up the morale of the crew when they sing songs together from time to time while scrubbing the deck or mending the sail cloths.",
            "allows": "",
            "effect": "2% less upkeep for ships",
            "requirements": ["piracy"]
            },
     "draft": {"id": "draft",
            "name": "Draft",
            "type": "sea",
            "category": "Seafaring",
            "costs": 24,
            "description": "Our scientists have found out that our ships have less water resistance when their load is smaller. This means that we can put larger sails on the mast and travel more quickly.",
            "allows": "Quicker ships with a lighter load.",
            "effect": "",
            "requirements": ["ship_maintenance"]
            },
    "pulley": {"id": "pulley",
        	"name": "Pulley",
            "type": "eco",
            "category": "Economy",
            "costs": 24,
            "description": "A brilliant idea: A rope that is pulled over a roll gives a simple man the strength of Hercules. So now our workers can lift up huge blocks of stone on their own and construct our buildings even faster!",
            "allows": "",
            "effect": "2% less building costs",
            "requirements": ["conservation"]
            },
    "well_construction": {"id": "well_construction",
            "name": "Well construction",
            "type": "sci",
            "category": "Science",
            "costs": 24,
            "description": "Eureka! A well in our settlement! Now we don't have to wait for it to rain all the time. Our citizens will be much better off and the fields won't have to stay dry for very long!",
            "allows": "",
            "effect": "+50 housing space, +50 happiness in the capital",
            "requirements": []
            },
    "maps": {"id": "maps",
            "name": "Maps",
            "type": "mil",
            "category": "Military",
            "costs": 24,
            "description": "These long marches over the hills and through the swamps mean that our material will wear out very fast. If we write down, how our soldiers can travel over land without always getting stuck in the undergrowth or sinking into the mud, the soldiers will have to mend their uniforms a lot less often.",
            "allows": "",
            "effect": "2% less upkeep for soldiers",
            "requirements": ["dry-dock"]
            },
    "paper": {"id": "paper",
            "name": "Paper",
            "type": "sci",
            "category": "Science",
            "costs": 30,
            "description": "We have found a better way to archive our knowledge! Now we have scriptures made from the papyrus plant, so we don`t have to chisel our words into the heavy stones anymore in order to fill our library!",
            "allows": "",
            "effect": "2% more research points",
            "requirements": ["well_construction"]
            },
    "wealth": {"id": "wealth",
        	"name": "Wealth",
            "type": "eco",
            "category": "Economy",
            "costs": 112,
            "description": "The earth is full of valuable treasures! We have learned how to mine sulphur and crystal and how to chisel marble off rocks. We are also growing wonderful vines on the fertile land on our hills which produce delicious wine!",
            "allows": "Allows the production of luxury goods, the construction of trading posts and gives you 130 units of each luxury good.",
            "effect": "",
            "requirements": ["pulley"]
            },
    "expansion": {"id": "expansion",
            "name": "Expansion",
            "type": "sea",
            "category": "Seafaring",
            "costs": 336,
            "description": "There is a lot more than just an ocean out there! More islands await being discovered. We are not alone! We can gain ground on one of the newly discovered islands, tap new resources and get to know other nations! Our clerks are eager to administer even more, our traders ready to travel to new lands!",
            "allows": "Building of palaces, founding of colonies, overseas trading",
            "effect": "",
            "requirements": ["draft","wealth"]
            },
    "wine_culture": {"id": "wine_culture",
        	"name": "Wine culture",
            "type": "eco",
            "category": "Economy",
            "costs": 336,
            "description": "A happy population needs festivals in which they can spend hours revelling and drinking our fantastic free-flowing wine. Dionysus loves seeing us enjoying what he has given us!",
            "allows": "Building of taverns",
            "effect": "",
            "requirements": ["wealth","well_construction"]
            },
    "professional_army": {"id": "professional_army",
            "name": "Professional Army",
            "type": "mil",
            "category": "Military",
            "costs": 336,
            "description": "Chasing away pirates, barbarians and other villains will be much easier with some professional soldiers! It might be more expensive than just making our citizens into soldiers in the event of war, but in exchange our troops will be able to handle sword, spear and shield much better!",
            "allows": "Recruiting of swordsmen and hoplites at the barracks",
            "effect": "",
            "requirements": ["maps","wealth"]
            },
    "espionage": {"id": "espionage",
            "name": "Espionage",
            "type": "sci",
            "category": "Science",
            "costs": 420,
            "description": "When some of our citizens settle down in other towns, they can help us to keep an eye on our neighbours. We could keep ourselves informed when a neighbour makes a discovery or what kind of resources he has in stock.",
            "allows": "Building of hideouts",
            "effect": "",
            "requirements": ["paper","wealth"]
            },
    "foreign_cultures": {"id": "foreign_cultures",
            "name": "Foreign Cultures",
            "type": "sea",
            "category": "Seafaring",
            "costs": 1032,
            "description": "If we get to know other nations, it will help us to make progress ourselves. Regular talks and warm exchanges can work true wonders and lead to new alliances and friendships. Of course we need a pretty and comfortable building for all the ambassadors and the feasts we will hold in their honour!",
            "allows": "Construction of Embassies",
            "effect": "",
            "requirements": ["expansion","espionage"]
            },
    "siege": {"id": "siege",
            "name": "Siege",
            "type": "mil",
            "category": "Military",
            "costs": 1032,
            "description": "With a ram's head made of metal and the strength of ten men we can even tear down town walls. Now it will be easy for our soldiers to conquer other towns!",
            "allows": "Building of battering rams in the barracks",
            "effect": "",
            "requirements": ["professional_army","espionage"]
            },
    "improved_resource_gathering": {"id": "improved_resource_gathering",
        	"name": "Improved resource gathering",
            "type": "eco",
            "category": "Economy",
            "costs": 1204,
            "description": "Some time has passed since we learned how to use the treasures of our island for our own needs. We should now educate our workers and let every forest, quarry or vineyard, every sulphur pit or crystal mine be administered by men who are not only strong but also skilful. This way we will gather even more income and our civilization will get richer than ever!",
            "allows": "Construction of Forester Houses, Stonemasons, Wineries, Glassblowers and Alchemists' Towers",
            "effect": "",
            "requirements": ["wine_culture","expansion"]
            },
    "polytheism": {"id": "polytheism",
            "name": "Polytheism",
            "type": "sci",
            "category": "Science",
            "costs": 1428,
            "description": "Man cannot rationally explain everything that happens in the world. And whenever he cannot explain it, the answer is sought from the gods. Gods are like humans on the one hand, but are very different on the other hand. After all, what other kind of rational explanation can the unexplainable have?",
            "allows": "Temples and Miracles",
            "effect": "",
            "requirements": ["espionage","expansion","professional_army"]
            },
    "pitch": {"id": "pitch",
            "name": "Pitch",
            "type": "sea",
            "category": "Seafaring",
            "costs": 2236,
            "description": "That is some tough and bad smelling liquid our scientists have found there! But since we have started sticking it onto our ships there are hardly any holes we have to mend!",
            "allows": "",
            "effect": "4% less upkeep for ships",
            "requirements": ["foreign_cultures"]
            },
    "geometry": {"id": "geometry",
        	"name": "Geometry",
            "type": "eco",
            "category": "Economy",
            "costs": 2236,
            "description": "Right angles, triangles, circles – a few bright minds can calculate how we can construct our buildings even better and more beautifully. And soon our towns will serve as examples to the whole world!",
            "allows": "",
            "effect": "4% less building costs",
            "requirements": ["improved_resource_gathering"]
            },
    "code_of_honour": {"id": "code_of_honour",
            "name": "Code of Honour",
            "type": "mil",
            "category": "Military",
            "costs": 2236,
            "description": "Our soldiers are proud of serving their unit and their island kingdom. They are even taking better care of their uniforms, so that we don't have to mend and repair them as often.",
            "allows": "",
            "effect": "4% less upkeep costs and allows the form of government",
            "requirements": ["siege"]
            },
    "ink": {"id": "ink",
            "name": "Ink",
            "type": "sci",
            "category": "Science",
            "costs": 2652,
            "description": "Nature gives us everything we need to write: The birds give us their feathers and eight-armed fish out of the sea provide us with their black ink! Now we can write down our ideas even more easily!",
            "allows": "",
            "effect": "4% more research points",
            "requirements": ["polytheism"]
            },
    "government_formation": {"id": "government_formation",
            "name": "Government Formation",
            "type": "sci",
            "category": "Science",
            "costs": 2836,
            "description": "We have been thinking about the fact that a different form of government could give us special advantages. To do so there would be quite a lot to organise and we would possibly have to cut down on some staff, but it would be great to have that kind of government.",
            "allows": "Start of a revolution, forms of government",
            "effect": "",
            "requirements": ["ink"]
            },
    "market": {"id": "market",
            "name": "Market",
            "type": "sea",
            "category": "Seafaring",
            "costs": 3264,
            "description": "The most unusual goods arrive at the market here from distant islands. You can form treaties with merchants here so that we get all the resources that we need.",
            "allows": "treaties, form of government",
            "effect": "",
            "requirements": ["pitch","improved_resource_gathering"]
            },
    "ballistics": {"id": "ballistics",
            "name": "Ballistics",
            "type": "mil",
            "category": "Military",
            "costs": 3264,
            "description": "Now we know how to shoot arrows at our enemies. We should start right now to train our soldiers with these skills, so we can have archers joining our army in battle soon!",
            "allows": "Training of archers in the barracks",
            "effect": "",
            "requirements": ["code_of_honour"]
            },
    "architecture": {"id": "architecture",
        	"name": "Architecture",
            "type": "eco",
            "category": "Economy",
            "costs": 3672,
            "description": "A good house can withstand the harshest elements. It can withstand them even better when a clever mind takes care of it with a lot of drawings and a little mathematics before hand, so that all the walls are straight and the roof is tight. Thanks to angles and compasses our buildings will be much more stable and well protected from the rain. An architect's office would spare us a lot of marble, just think about the savings we could make in constructing a new building!",
            "allows": "Building of an architect's office",
            "effect": "",
            "requirements": ["geometry","polytheism"]
            },
    "invention": {"id": "invention",
            "name": "Invention",
            "type": "sci",
            "category": "Science",
            "costs": 4320,
            "description": "There has recently been a number of incidents relating to exploding powder and other substances. That's why we have set up an own workshop for all the nosy scientists, so that all the explosions don't disturb the work in the academy any more. It also has stronger walls and can't burn down as easily.",
            "allows": "Building of workshops",
            "effect": "",
            "requirements": ["government_formation","improved_resource_gathering"]
            },
    "greek_fire": {"id": "greek_fire",
            "name": "Greek Fire",
            "type": "sea",
            "category": "Seafaring",
            "costs": 7020,
            "description": "A fire that can't be extinguished with water! With this mixture from many secret ingredients we can now set fire to ships and sink them! Soon we will conquer the seas with ships that have the breath of a dragon!",
            "allows": "Building of flame ships in the shipyard",
            "effect": "",
            "requirements": ["market","polytheism"]
            },
    "law_of_the_lever": {"id": "law_of_the_lever",
            "name": "Law of the Lever",
            "type": "mil",
            "category": "Military",
            "costs": 7020,
            "description": "With this technology we can unleash powers that can even let huge rocks fly through the air! And if the rocks are large enough, they can even tear down town walls!",
            "allows": "Building of catapults in the barracks",
            "effect": "",
            "requirements": ["ballistics","invention"]
            },
    "relaxation_holiday": {"id": "relaxation_holiday",
        	"name": "Relaxation holiday",
            "type": "eco",
            "category": "Economy",
            "costs": 7200,
            "description": "A worker who has had a good rest is much more eager to work than an exhausted one. That's why every citizen should have one day off per week. This will make all our citizens happier!",
            "allows": "",
            "effect": "Increases the satisfaction and maximum population in all towns",
            "requirements": ["architecture"]
            },
    "legislation": {"id": "legislation",
        	"name": "Legislation",
            "type": "eco",
            "category": "Economy",
            "costs": 8242,
            "description": "We think it's a good idea to define the rules of living together on paper. This means that every island inhabitant can look up what's allowed and what isn't - meaning they'll be no more room for excuses!",
            "allows": "Form of government",
            "effect": "",
            "requirements": ["relaxation_holiday","ink"]
            },
    "cultural_exchange": {"id": "cultural_exchange",
            "name": "Cultural Exchange",
            "type": "sci",
            "category": "Science",
            "costs": 8694,
            "description": "Our citizens should really have the chance to look at the cultural achievements of other people. And surely, in exchange, they will be interested in learning from us and exhibiting some of our great works of art in their museums.",
            "allows": "Building of museums, cultural goods treaties, Phoenician merchant ships",
            "effect": "",
            "requirements": ["invention"]
            },
    "counterweight": {"id": "counterweight",
            "name": "Counterweight",
            "type": "sea",
            "category": "Seafaring",
            "costs": 9936,
            "description": "Our scientists have improved the weapon attachment for our ships, so that they don't tear apart when we fling huge rocks towards our enemies. And thanks to the counterweight our catapult stays on board now and doesn't launch itself anymore.",
            "allows": "Building of catapult-ships at the shipyard",
            "effect": "",
            "requirements": ["greek_fire","architecture"]
            },
    "culinary_specialities": {"id": "culinary_specialities",
        	"name": "Culinary Specialities",
            "type": "eco",
            "category": "Economy",
            "costs": 10764,
            "description": "Our culture is truly rich in delicious treats! If we have cooks joining our soldiers in battle the delicious smell will be enough to remind them of their kitchen at home and surely strengthen their fighting spirit. And it shouldn't be forgotten, that a hearty meal has always brought a man back onto his feet. And of course a cook has a sharp knife that he can jump into the fight with.",
            "allows": "Training of chefs in the barracks",
            "effect": "",
            "requirements": ["legislation","market"]
            },
    "governor": {"id": "governor",
            "name": "Governor",
            "type": "mil",
            "category": "Military",
            "costs": 11592,
            "description": "If we employ a civil servant, we can then not only pillage our enemies' towns, but also use and manage them. In no time we will be able to occupy foreign towns with our army from which we can then carry out further missions to increase our wealth and prosperity.",
            "allows": "Occupation",
            "effect": "",
            "requirements": ["law_of_the_lever","wine_culture"]
            },
    "anatomy": {"id": "anatomy",
            "name": "Anatomy",
            "type": "sci",
            "category": "Science",
            "costs": 14952,
            "description": "We have learned a lot about the human body! Now we can send doctors into battle to help the wounded soldiers to quickly get back on their feet again. Of course they can mix the right tinctures and some doctors even know a secret recipe for a mixture that makes our fighters even braver.",
            "allows": "Recruiting of doctors in the barracks",
            "effect": "",
            "requirements": ["cultural_exchange"]
            },
    "diplomacy": {"id": "diplomacy",
            "name": "Diplomacy",
            "type": "sea",
            "category": "Seafaring",
            "costs": 17064,
            "description": "One of our philosophers has written down wise things about war and peace. He has advised us to confederate with other nations so that we can fight our enemies together!",
            "allows": "Garrison right",
            "effect": "",
            "requirements": ["counterweight","governor"]
            },
    "helping_hands": {"id": "helping_hands",
        	"name": "Helping hands",
            "type": "eco",
            "category": "Economy",
            "costs": 19908,
            "description": "If our citizens help out a little underground instead of tanning themselves on the beach, we’ll get more raw materials and they’ll get less sunburn. There’s always a need for help down the mines, saw mills and vineyards.",
            "allows": "Overloading of resources",
            "effect": "",
            "requirements": ["culinary_specialities","cultural_exchange"]
            },
    "pyrotechnics": {"id": "pyrotechnics",
            "name": "Pyrotechnics",
            "type": "mil",
            "category": "Military",
            "costs": 19908,
            "description": "Sulphur is a really is a work of the devil! And with every new mixture, we can get even more impact from this precious resource. A safe practice ground would allow our blasters to test their inventions, without including the surrounding buildings as involuntary targets into their experiments.",
            "allows": "Building of firework test area",
            "effect": "",
            "requirements": ["governor","improved_resource_gathering"]
            },
    "optics": {"id": "optics",
            "name": "Optics",
            "type": "sci",
            "category": "Science",
            "costs": 21360,
            "description": "When our scientists invent new things, many a glass can break. Or it gets lost in the infinite vastness of our laboratories, as keeping them tidy isn't really the primal virtue of the academy. If an optician would take care of not only the quality, but also that all the lenses and glasses are put back where they belong, we would use far less crystal glass!",
            "allows": "Building of an optician's",
            "effect": "",
            "requirements": ["anatomy","architecture"]
            },
    "experiments": {"id": "experiments",
            "name": "Experiments",
            "type": "sci",
            "category": "Science",
            "costs": 21360,
            "description": "Our scientists would like to test their theories in practice. These kinds of attempts will probably accelerate the research, but it does mean we will need a certain amount of additional laboratory equipment.",
            "allows": "Purchase of research points for crystal glass, form of government",
            "effect": "",
            "requirements": ["optics"]
            },
    "sea_maps": {"id": "sea_maps",
            "name": "Sea maps",
            "type": "sea",
            "category": "Seafaring",
            "costs": 25632,
            "description": "Our voyages will be much safer if we write down where all the dangerous currents and treacherous shallows are! Then our seamen won't have to be afraid of any jagged rocks, deadly maelstroms or seductive sirens any more.",
            "allows": "",
            "effect": "8% less upkeep for ships",
            "requirements": ["diplomacy"]
            },
    "spirit_level": {"id": "spirit_level",
        	"name": "Spirit Level",
            "type": "eco",
            "category": "Economy",
            "costs": 25632,
            "description": "Water is always even. We should use this knowledge so that our buildings become even, too! Our town will become even more beautiful and we will use less stone and wood for constructing our buildings!",
            "allows": "",
            "effect": "8% less cost for the construction of buildings.",
            "requirements": ["helping_hands"]
            },
    "logistics": {"id": "logistics",
            "name": "Logistics",
            "type": "mil",
            "category": "Military",
            "costs": 25632,
            "description": "Our soldiers can fight much better if they don't have to drag that much. And their equipment will last much longer on the long marches, so we won't have to mend it that often.",
            "allows": "",
            "effect": "8% less upkeep for soldiers",
            "requirements": ["pyrotechnics"]
            },
    "mechanical_pen": {"id": "mechanical_pen",
            "name": "Mechanical Pen",
            "type": "sci",
            "category": "Science",
            "costs": 31968,
            "description": "A brilliant little apparatus: A smart inventor has managed to teach writing to a machine. Now we can copy our scriptures easily and our academies can quickly exchange their ideas with each other!",
            "allows": "",
            "effect": "8% more research points",
            "requirements": ["experiments"]
            },
    "paddle_wheel_engine": {"id": "paddle_wheel_engine",
            "name": "Paddle Wheel Engine",
            "type": "sea",
            "category": "Seafaring",
            "costs": 38400,
            "description": "Great news for our seamen: A steam driven paddle wheel allows our ships to move much faster than they ever could with oarsmen. Now we can teach our enemies to fear us with our mighty paddle wheel rams.",
            "allows": "Construction of paddle speedboats in the shipyard",
            "effect": "",
            "requirements": ["sea_maps","cultural_exchange"]
            },
    "gunpowder": {"id": "gunpowder",
            "name": "Gunpowder",
            "type": "mil",
            "category": "Military",
            "costs": 38400,
            "description": "This black mixture from the alchemist's kitchen can spark a fire with a loud bang and do truly devilish things! Now we can fill iron pipes with this powder to shoot heavy cannon balls through the air.",
            "allows": "Construction of carabineers in the barracks and rocket ships in the shipyard",
            "effect": "",
            "requirements": ["logistics","optics"]
            },
    "birds_flight": {"id": "birds_flight",
            "name": "Bird`s Flight",
            "type": "sci",
            "category": "Science",
            "costs": 46848,
            "description": "We have learned how to fly like the birds! Now we can build a machine that can lift a man up into the skies and can whizz above the heads of our enemies with breath-taking speed, shooting arrows far behind the front lines.",
            "allows": "Construction of Gyrocopter in the barracks",
            "effect": "",
            "requirements": ["mechanical_pen","ballistics"]
            },
    "wine_press": {"id": "wine_press",
        	"name": "Wine Press",
            "type": "eco",
            "category": "Economy",
            "costs": 48000,
            "description": "What an event those annual wine fêtes are! The whole town is there when the best grapes in town are stomped into wine and when the liquid gold splashes around, the kids have the most fun! With a wine press though, handled by an experienced winemaker, we would lose much less. The winemaker could also organise proper storage that allows us to let the wine age and mature well!",
            "allows": "Building of wine cellars",
            "effect": "",
            "requirements": ["spirit_level"]
            },
    "depot": {"id": "depot",
            "name": "Depot",
            "type": "eco",
            "category": "Economy",
            "costs": 48000,
            "description": "As our warehouses cannot handle the increasing amount of goods, we will need alternatives in the long run. Advanced methods of sealed tarpaulins and covers should enable us to store large amounts of goods in the open air.",
            "allows": "Allows you to build depots.",
            "effect": "",
            "requirements": ["wine_press"]
            },
    "caulking": {"id": "caulking",
            "name": "Caulking",
            "type": "sea",
            "category": "Seafaring",
            "costs": 53000,
            "description": "With this technology, our engineers can seal leaky ships. Caulking in and in front of the port is a complicated undertaking, but gives our fleets the chance to get ready for battle between two attacks.",
            "allows": "Construction of tenders in the shipyard",
            "effect": "",
            "requirements": ["paddle_wheel_engine"]
            },
    "soldier_exchange": {"id": "soldier_exchange",
        	"name": "Soldier Exchange",
            "type": "eco",
            "category": "Economy",
            "costs": 56000,
            "description": "Our battle-tested warriors in their shiny armour, and our progressive war machines have become legendary. Now it's time to make a profit from them. Other leaders will be eager to purchase these troops.",
            "allows": "building the Black Market",
            "effect": "",
            "requirements": ["depot"]
            },
    "mortar_attachment": {"id": "mortar_attachment",
            "name": "Mortar Attachment",
            "type": "sea",
            "category": "Seafaring",
            "costs": 93240,
            "description": "This mortar is so huge, that not even Hercules could drag it along. Only an armoured steam ship is strong enough to carry it and all the huge cannon balls it can fire at our enemies.",
            "allows": "Building of mortar ships in the shipyard",
            "effect": "",
            "requirements": ["caulking","optics"]
            },
    "bureaucracy": {"id": "bureaucracy",
        	"name": "Bureaucracy",
            "type": "eco",
            "category": "Economy",
            "costs": 106560,
            "description": "Now our palace has even more shelves, boxes and drawers, more piles of records and forms as well as clerks who can understand it all. Finally we can afford to build and administer an additional building in our towns!",
            "allows": "An additional building space in the towns.",
            "effect": "",
            "requirements": ["soldier_exchange"]
            },
    "robotics": {"id": "robotics",
            "name": "Robotics",
            "type": "mil",
            "category": "Military",
            "costs": 106560,
            "description": "Our scientists have built a mechanical giant with muscles made of metal and a steaming heart! Only the keenest and most skilled soldiers can steer such a colossus, but it will strike fear into everyone on the battlefield!",
            "allows": "Building of steam giants in the barracks",
            "effect": "",
            "requirements": ["gunpowder"]
            },
    "massive_ram": {"id": "massive_ram",
            "name": "Massive Ram",
            "type": "sea",
            "category": "Seafaring",
            "costs": 120000,
            "description": "One of the most dangerous sea units can be built with the ram. This masterpiece of engineering ingenuity is attached to the ship's bow and can inflict massive amounts of damage onto other ships.",
            "allows": "Construction of steam rams in the shipyard",
            "effect": "",
            "requirements": ["mortar_attachment"]
            },
    "letter_chute": {"id": "letter_chute",
            "name": "Letter Chute",
            "type": "sci",
            "category": "Science",
            "costs": 144720,
            "description": "A marvel: We can now shoot scrolls through pipes, so that they reach our scientists even faster! This saves us long errands and we have to pay less gold for our scientists!",
            "allows": "",
            "effect": "3 Gold upkeep cost less per scientist",
            "requirements": ["birds_flight","counterweight","helping_hands","pyrotechnics"]
            },
    "state_religion": {"id": "state_religion",
            "name": "State Religion",
            "type": "sci",
            "category": "Science",
            "costs": 202074,
            "description": "Actually we don't need any secular laws - the religious ones are more than enough. And while we're at it: we don't actually need all our civil servants.",
            "allows": "Form of government",
            "effect": "",
            "requirements": ["letter_chute"]
            },
    "cannon_casting": {"id": "cannon_casting",
            "name": "Cannon Casting",
            "type": "mil",
            "category": "Military",
            "costs": 209040,
            "description": "Our iron is getting heavier and harder: now we can even build barrels through which we can fire huge cannon balls at our enemies! If we can even fire bombs from a long distance our enemies and their town walls will tremble in fear!",
            "allows": "Building of mortars in the barracks",
            "effect": "",
            "requirements": ["robotics"]
            },
    "pressure_chamber": {"id": "pressure_chamber",
            "name": "Pressure Chamber",
            "type": "sci",
            "category": "Science",
            "costs": 209880,
            "description": "Now we can let our ships sail under water, without them sinking! The oceans are ours! No enemy will see us, when we stalk them under water and sink them before they notice us!",
            "allows": "Building of submersibles in the shipyard",
            "effect": "",
            "requirements": ["state_religion","paddle_wheel_engine","robotics"]
            },
    "utopia": {"id": "utopia",
        	"name": "Utopia",
            "type": "eco",
            "category": "Economy",
            "costs": 241200,
            "description": "Our citizens are living in wealth and prosperity. They are happy and healthy and have very little to worry about. Yes, one could say we are living in one of those places that you can only find in the scriptures from one of the great philosophers.",
            "allows": "",
            "effect": "+200 housing space, +200 satisfaction in the capital",
            "requirements": ["bureaucracy","massive_ram","letter_chute","gunpowder"]
            },
    "the_archimedean_principle": {"id": "the_archimedean_principle",
            "name": "The Archimedean Principle",
            "type": "sci",
            "category": "Science",
            "costs": 444000,
            "description": "We have managed to get a machine to fly! Now even the sky isn't a limit anymore! We can let huge balloons fly over the heads of our enemies and throw fire or bee-hives at them from above!",
            "allows": "Building of bombardiers in the barracks",
            "effect": "",
            "requirements": ["pressure_chamber"]
            },
    "offshore_base": {"id": "offshore_base",
            "name": "Offshore Base",
            "type": "sea",
            "category": "Seafaring",
            "costs": 475000,
            "description": "We can use this research to build some of the largest ships in the shipyard. These are equipped with balloons that bomb opponents on the high seas.",
            "allows": "Construction of balloon carriers in the shipyard",
            "effect": "",
            "requirements": ["massive_ram","the_archimedean_principle"]
            },
    "seafaring_future": {"id": "seafaring_future",
            "name": "Seafaring Future",
            "type": "sea",
            "category": "Seafaring",
            "costs": 532800,
            "description": "The secrets of the oceans are finally ours! Our ships are constantly becoming tougher and faster! There are almost no ships on this ocean capable of competing with ours.",
            "allows": "",
            "effect": "2% less upkeep for ships",
            "requirements": ["offshore_base","utopia","the_archimedean_principle","cannon_casting"]
            },
    "economic_future": {"id": "economic_future",
        	"name": "Economic Future",
            "type": "eco",
            "category": "Economy",
            "costs": 532800,
            "description": "Our citizens are wealthy and the marketplace is spilling over with delicacies from all over the world! The streets are clean and developed, making it easier for building material to reach the building site more quickly.",
            "allows": "",
            "effect": "+10 satisfaction and +20 max. inhabitants in every town per level of this future research.",
            "requirements": ["offshore_base","utopia","the_archimedean_principle","cannon_casting"]
            },
    "militaristic_future": {"id": "militaristic_future",
            "name": "Militaristic Future",
            "type": "mil",
            "category": "Military",
            "costs": 532800,
            "description": "Our war machines are stronger and mightier than ever before and our armies are perfectly organised! Our civil servants managing the military have everything under control and thus the upkeep costs can be lowered.",
            "allows": "",
            "effect": "2% less upkeep for units",
            "requirements": ["offshore_base","utopia","the_archimedean_principle","cannon_casting"]
            },
    "scientific_future": {"id": "scientific_future",
            "name": "Scientific Future",
            "type": "sci",
            "category": "Science",
            "costs": 610560,
            "description": "The smartest brains in the world are working to answer the big question: Why are we here? Why is everything the way it is? And once again we are one step closer to enlightenment.",
            "allows": "",
            "effect": "2% more research points",
            "requirements": ["offshore_base","utopia","the_archimedean_principle","cannon_casting"]
            }
}